Rechnerubung/Week6/turbulent_channel_periodic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          90;
        startFace       268;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          90;
        startFace       358;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    bottom
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          2;
        startFace       448;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2;
        startFace       450;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          360;
        startFace       452;
    }
)

// ************************************************************************* //
