Rechnerubung/Week6/turbulent_channel_periodic/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
  type                  meanVelocityForce;
  active                yes;

  meanVelocityForceCoeffs
  {
    selectionMode       all;

    fields              (U);
    Ubar                (1.85 0 0);
    relaxation           1.0;
  }
}

// ************************************************************************* //