Rechnerubung/Week6/turbulent_channel_periodic/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
type            sets;

libs            ("libsampling.so");

writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;



// sets
// (
//     U
//     {
//         type    lineUniform;
//         axis    y;
//         start   (0  0   0);
//         end     (1  0.1 0);
//         nPoints 200;
//     }
// )

sets
(
    x
    {
        type    lineUniform;
        axis    y;
        start   (0  0   0);
        end     (1  0.1 0);
        nPoints 200;
    }
    
);

fields          (U);
// ************************************************************************* //
